hw-rottenpotatoes/hw-rottenpotatoes/app/controllers/movies_controller.rb

  def index

    if params.has_key?(:sort)
      then
        @sort =  params[:sort]
        result = Movie.order(@sort)
        session[:sort]=@sort
        flash[:sort]=@sort
        flash.keep
      else
        result = Movie
    end

    @all_ratings = Movie.ratings

    if params.has_key?(:ratings)
      then
        @ratings = params[:ratings].map {|r| r.first}
        session[:ratings]=@ratings
        @movies = result.where(rating: @ratings)
---
SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R')  ORDER BY release_date